Repository: SteveShi/inkies
Catalog: inkies/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: A beautiful native macOS layout with side-by-side editor, preview, and sidebar.
zh_hans: 精美的原生 macOS 布局，侧边栏、编辑器与预览界面并排显示。

source: Add Item
zh_hans: 新建文件

source: Add Watch Expression
zh_hans: 添加监视表达式

source: Add watch expression...
zh_hans: 添加监视表达式...

source: Basic Choice
zh_hans: 基本选项

source: Basic structure
zh_hans: 基本结构

source: Block comment
zh_hans: 块注释

source: Cancel
zh_hans: 取消

source: Characters
zh_hans: 字符

source: Choice with mixed output
zh_hans: 混合输出选项

source: Choice without printing
zh_hans: 不打印的选项

source: Choices
zh_hans: 选项

source: Clean, minimalist line number display for improved focus and readability.
zh_hans: 简洁利落的行号显示，提升专注度与可读性。

source: Close
zh_hans: 关闭

source: Comments
zh_hans: 注释

source: Compiler Error: inklecate might be missing.
zh_hans: 编译错误：可能是 inklecate 未安装。

source: Condition
zh_hans: 条件

source: Continue
zh_hans: 继续

source: Crime Scene (from Writing with Ink)
zh_hans: 犯罪现场 (来自 Writing with Ink)

source: Crime Scene (Original)
zh_hans: 犯罪现场 (原版)

source: Dark Mode
zh_hans: 暗黑模式

source: Delete
zh_hans: 删除

source: Dialogue Example (Original)
zh_hans: 对话示例 (原版)

source: Divert
zh_hans: 跳转

source: Document Statistics
zh_hans: 文档统计

source: Ending indicator
zh_hans: 结束标记

source: Enter variable name to watch
zh_hans: 输入要监视的变量名

source: Export Failed
zh_hans: 导出失败

source: Export Ink (.ink)
zh_hans: 导出源码 (.ink)

source: Export JSON (.json)
zh_hans: 导出编译文件 (.json)

source: Export Options
zh_hans: 导出选项

source: Export Success
zh_hans: 导出成功

source: Export Web (.html)
zh_hans: 导出网页 (.html)

source: Export your stories to JSON or Web (HTML).
zh_hans: 将你的故事导出为 JSON 或 Web (HTML) 格式。

source: Export...
zh_hans: 导出...

source: Fixed missing titlebar separators and improved overall window visual hierarchy.
zh_hans: 修复了缺失的标题栏分隔线，并优化了窗口的整体视觉层级。

source: Fixed Undo Logic
zh_hans: 修复撤销逻辑

source: Flicker-free incremental updates and faster compilation.
zh_hans: 更流畅的无闪烁增量更新和更快的编译速度。

source: Flow: came_from
zh_hans: 流程: came_from

source: Flow: seen_more_recently_than
zh_hans: 流程: seen_more_recently_than

source: Flow: seen_very_recently
zh_hans: 流程: seen_very_recently

source: Follow System
zh_hans: 跟随系统

source: Full stories
zh_hans: 完整故事

source: Get variable type
zh_hans: 获取变量类型

source: Global variable
zh_hans: 全局变量

source: Go to anything...
zh_hans: 跳转到...

source: HTML Formatting
zh_hans: HTML 格式支持

source: Ink Syntax Checking
zh_hans: Ink 语法检查

source: Inline logic
zh_hans: 内联逻辑

source: Knot (main section)
zh_hans: 结(主要章节)

source: Knots
zh_hans: 结

source: Light Mode
zh_hans: 明亮模式

source: Lines
zh_hans: 行数

source: List Items as Integer Variables
zh_hans: 列表项作为整数变量

source: List-handling
zh_hans: 列表处理

source: List: list_item_is_member_of
zh_hans: 列表: list_item_is_member_of

source: List: LIST_NEXT and LIST_PREV
zh_hans: 列表: LIST_NEXT 和 LIST_PREV

source: List: list_random_subset
zh_hans: 列表: list_random_subset

source: List: pop
zh_hans: 列表: pop

source: List: pop_random
zh_hans: 列表: pop_random

source: Logic: maybe
zh_hans: 逻辑: maybe

source: Mathematics: abs
zh_hans: 数学: abs

source: Mathematics: divisor
zh_hans: 数学: divisor

source: Modify variable
zh_hans: 修改变量

source: Multi-line logic
zh_hans: 多行逻辑

source: Murder Scene (Inky Example)
zh_hans: 谋杀现场 (Inky 示例)

source: Native Separators
zh_hans: 原生分隔线

source: Native syntax highlighting for Ink script while you type.
zh_hans: 编写 Ink 时享受原生的语法高亮体验。

source: New Document
zh_hans: 新文档

source: New Ink File
zh_hans: 新建ink文件

source: New Title
zh_hans: 新标题

source: Next Issue
zh_hans: 下一个问题

source: No document selected
zh_hans: 未选择文档

source: OK
zh_hans: 好

source: Performance Boost
zh_hans: 性能提升

source: Preview Controls
zh_hans: 预览控制

source: Printing: a (or an)
zh_hans: 打印: a (或 an)

source: Printing: list_with_commas
zh_hans: 打印: 逗号分隔列表

source: Printing: UPPERCASE
zh_hans: 打印: 大写

source: Real-time Highlighting
zh_hans: 实时语法高亮

source: Real-time Ink syntax validation with visual error and warning markers.
zh_hans: 实时验证 Ink 语法，并提供直观的错误和警告标记。

source: Refined 3-Column Layout
zh_hans: 精致三栏布局

source: Refined Ruler
zh_hans: 精致行号栏

source: Rename
zh_hans: 重命名

source: Rename Document
zh_hans: 重命名文档

source: Resolved rendering issues and improved document deletion behavior.
zh_hans: 解决了渲染问题并优化了文档删除行为。

source: Restart
zh_hans: 重新开始

source: Restart story
zh_hans: 重新开始故事

source: Return to previous branch
zh_hans: 返回上一分支

source: Save Project
zh_hans: 保存项目

source: Search
zh_hans: 搜索

source: Select a document
zh_hans: 请选择一个文档

source: Simple Dialogue Example
zh_hans: 简单对话示例

source: Single-line comment
zh_hans: 单行注释

source: Stability Fixes
zh_hans: 稳定性修复

source: Sticky choice
zh_hans: 粘性选项

source: Stitch (sub-section)
zh_hans: 针(子章节)

source: Story
zh_hans: 故事

source: Storylets
zh_hans: 故事片段系统

source: Support for italicized and bold text in the story preview using standard HTML tags.
zh_hans: 支持在故事预览中使用标准 HTML 标签显示斜体和加粗文本。

source: Swindlestones (Inky Example)
zh_hans: 骗徒之石 (Inky 示例)

source: Swing Variables
zh_hans: 摆动变量

source: Syntax Checking
zh_hans: 语法检查

source: Tags visible
zh_hans: 显示标签

source: Temporary variable
zh_hans: 临时变量

source: The application now remembers its window size and position across launches.
zh_hans: 应用程序现在可以在启动时记住并恢复窗口的大小和位置。

source: The Intercept (Inky Example)
zh_hans: 拦截 (Inky 示例)

source: The Undo button now correctly reverts your choices while preserving the story log.
zh_hans: 撤销按钮现在可以正确回退选择，并完整保留故事日志记录。

source: Theme
zh_hans: 主题

source: Undo
zh_hans: 撤销

source: Undo choices and restart your story directly from the toolbar.
zh_hans: 直接从工具栏撤销选择或重新开始故事。

source: Untitled
zh_hans: 无标题

source: Useful functions
zh_hans: 实用函数

source: Useful systems
zh_hans: 实用系统

source: Variables
zh_hans: 变量

source: Version 0.5.0
zh_hans: 版本 0.5.0

source: Version 0.7.0
zh_hans: 版本 0.7.0

source: Version 0.7.2
zh_hans: 版本 0.7.2

source: What's New in Inkies
zh_hans: Inkies 的新功能

source: Window State Recovery
zh_hans: 窗口状态恢复

source: Word count and more
zh_hans: 字数统计

source: Words
zh_hans: 字数
